# RbsElecCircuitWireNumRunsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecCircuitWireNumRunsParam Property
ParameterTypeId Class See Also
---
"# of Runs"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecCircuitWireNumRunsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecCircuitWireNumRunsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecCircuitWireNumRunsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace